# Ejercicio Precipitacion

Para el ejercicio vamos a ocupar la base de datos de precipitacion de la RNEAA la cual incluye los siguientes campos:

* index : variable entera, indice del valor
* name :  variable texto, nombre de la estacion
* number :  variable entera: numero de la estacion
* lat : variable flotante :  latitud
* long :  variable flotante :  longitud
* year :  variable entera : anio
* month :  variable entera : mes
* day : variable entera : dia
* rain : variable flotante :  precipitacion 

Esta base de datos se encuentra en la carpeta **`data`** con el nombre de **`data_course_prec.csv`**

** Nota: Si ejecutas alguna celda de codigo el resultado puede desaparecer**

** Importar numpy y pandas como np y pd **

** Leer el archivo csv en un dataframe de nombre data **

** Checar los 5 primeros registros **

,Unnamed: 0,name,number,lat,long,year,month,day,rain
0,0,La Mirinda,2,22.248528,-102.251778,2013,2,1,0.0
1,1,La Mirinda,2,22.248528,-102.251778,2013,2,2,0.0
2,2,La Mirinda,2,22.248528,-102.251778,2013,2,3,0.0
3,3,La Mirinda,2,22.248528,-102.251778,2013,2,4,0.0
4,4,La Mirinda,2,22.248528,-102.251778,2013,2,5,0.0

** Checar las columnas del dataframe **

Index(['Unnamed: 0', 'name', 'number', 'lat', 'long', 'year', 'month', 'day',
       'rain'],
      dtype='object')

## Preguntas basicas

**Numero total de estaciones en la base de datos?**

798

**Cuales son los 5 anios con mas datos disponibles**

2012    197413
2013    196643
2011    194513
2010    180598
2014    177824
Name: year, dtype: int64

** Precipitacion acumulada en la base de datos?**

3404766.230001974

** Precipitacion acumulada por anios?**

year
1998       505.60
1999       384.40
2000       348.00
2001       306.00
2002     10636.40
2003     17764.60
2004     12696.00
2005     26111.00
2006    163170.80
2007    239853.70
2008    321554.50
2009    343231.00
2010    385126.50
2011    319845.50
2012    262108.59
2013    349818.50
2014    365120.60
2015    296162.72
2016    210905.67
2017     79116.15
Name: rain, dtype: float64

** Numero de dias con lluvia en la base de datos? **

378237

** Numero de dias sin lluvia en la base de datos? **

1290918

** Numero de dias con valores nulos en la base de datos? ** # NaN

330845

** Numero de registros en la base de datos?**

2000000

### Bonus
** Los 5 registros con la acumulacion mas alta (anio-mes)**

            rain
year	month	
2009	9	77153.4
2011	7	77229.4
2010	9	80205.4
2013	9	80912.0
2010	7	98629.7